<template>
  <div class="grid">
    <div class="grid-col_1-11">
      <div class="header">
        <div class="header-content">
            <div class="header-logos">
              <img src="~assets/image/icons/Logo.png" alt="">
              <img src="~assets/image/icons/jyl-logo.svg" alt="">
            </div>
          <div class="contacts">
            <a href="tel:340">
              <div class="call-phone">
                <div class="phone">
                  <img src="~assets/image/icons/phone-call.svg" alt />
                  <h3>340</h3>
                </div>
                <p>Бесплатно с мобильного</p>
              </div>
            </a>
          </div>
        </div>
          <a
            target="_blank"
            class="whatsapp_mobile"
            href="https://wa.me/77783603366?text=Добрый день, Меня интересует Новая ипотека от АО “Жилстройсбербанк Казахстана” и Nova City"
          >
            <button class="banner-consulting__whatsapp">
              <svg
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M17.7589 13.7907C17.7121 13.7682 15.9624 12.9067 15.6515 12.7948C15.5246 12.7492 15.3886 12.7047 15.244 12.7047C15.0078 12.7047 14.8093 12.8224 14.6547 13.0537C14.4799 13.3135 13.9508 13.932 13.7874 14.1168C13.766 14.1411 13.7369 14.1703 13.7194 14.1703C13.7038 14.1703 13.433 14.0588 13.351 14.0232C11.474 13.2079 10.0494 11.2473 9.85405 10.9167C9.82616 10.8692 9.82499 10.8476 9.82475 10.8476C9.8316 10.8224 9.89474 10.7591 9.92732 10.7265C10.0226 10.6323 10.1259 10.5079 10.2258 10.3877C10.2731 10.3308 10.3205 10.2737 10.367 10.2199C10.5119 10.0513 10.5764 9.92042 10.6512 9.76877L10.6904 9.68998C10.8731 9.32707 10.7171 9.02089 10.6666 8.92198C10.6252 8.83924 9.88649 7.05622 9.80793 6.8689C9.61902 6.41689 9.36946 6.20642 9.02263 6.20642C8.99043 6.20642 9.02263 6.20642 8.88768 6.21209C8.72333 6.21903 7.82839 6.33683 7.43272 6.58629C7.0131 6.85086 6.30322 7.69409 6.30322 9.17712C6.30322 10.5118 7.15025 11.7721 7.51391 12.2514C7.52296 12.2635 7.53955 12.288 7.56364 12.3232C8.95635 14.3571 10.6926 15.8645 12.4526 16.5676C14.147 17.2444 14.9494 17.3226 15.4055 17.3226C15.4056 17.3226 15.4056 17.3226 15.4056 17.3226C15.5973 17.3226 15.7507 17.3076 15.8861 17.2943L15.9719 17.2861C16.5573 17.2342 17.8436 16.5676 18.1362 15.7545C18.3667 15.1141 18.4275 14.4143 18.2741 14.1604C18.1691 13.9876 17.988 13.9007 17.7589 13.7907Z"
                  fill="white"
                />
                <path
                  d="M12.2131 0C5.71309 0 0.424978 5.24836 0.424978 11.6994C0.424978 13.7859 0.983352 15.8284 2.04118 17.6159L0.0165091 23.5882C-0.0212253 23.6996 0.00685281 23.8227 0.0892122 23.9066C0.148697 23.9673 0.229321 24 0.311681 24C0.343228 24 0.375009 23.9953 0.40604 23.9853L6.63357 22.0064C8.33771 22.9169 10.2638 23.3976 12.2131 23.3976C18.7125 23.3977 24 18.1499 24 11.6994C24 5.24836 18.7125 0 12.2131 0ZM12.2131 20.9606C10.3788 20.9606 8.60232 20.4309 7.07518 19.4288C7.02385 19.3951 6.96423 19.3778 6.90423 19.3778C6.87249 19.3778 6.84071 19.3826 6.80977 19.3925L3.69015 20.3841L4.69721 17.413C4.72979 17.3169 4.71348 17.2108 4.65348 17.1288C3.49055 15.5399 2.87584 13.6625 2.87584 11.6994C2.87584 6.59217 7.06444 2.43708 12.2129 2.43708C17.3608 2.43708 21.5489 6.59217 21.5489 11.6994C21.549 16.8061 17.361 20.9606 12.2131 20.9606Z"
                  fill="white"
                />
              </svg>
              Консультация по WhatsApp
            </button>
          </a>
          <a
            target="_blank"
            class="whatsapp_desktop"
            href="https://web.whatsapp.com/send?phone=77783603366&text=Добрый день, Меня интересует Новая ипотека от АО “Жилстройсбербанк Казахстана” и Nova City&source=&data="
          >
            <button class="banner-consulting__whatsapp">
              <svg
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M17.7589 13.7907C17.7121 13.7682 15.9624 12.9067 15.6515 12.7948C15.5246 12.7492 15.3886 12.7047 15.244 12.7047C15.0078 12.7047 14.8093 12.8224 14.6547 13.0537C14.4799 13.3135 13.9508 13.932 13.7874 14.1168C13.766 14.1411 13.7369 14.1703 13.7194 14.1703C13.7038 14.1703 13.433 14.0588 13.351 14.0232C11.474 13.2079 10.0494 11.2473 9.85405 10.9167C9.82616 10.8692 9.82499 10.8476 9.82475 10.8476C9.8316 10.8224 9.89474 10.7591 9.92732 10.7265C10.0226 10.6323 10.1259 10.5079 10.2258 10.3877C10.2731 10.3308 10.3205 10.2737 10.367 10.2199C10.5119 10.0513 10.5764 9.92042 10.6512 9.76877L10.6904 9.68998C10.8731 9.32707 10.7171 9.02089 10.6666 8.92198C10.6252 8.83924 9.88649 7.05622 9.80793 6.8689C9.61902 6.41689 9.36946 6.20642 9.02263 6.20642C8.99043 6.20642 9.02263 6.20642 8.88768 6.21209C8.72333 6.21903 7.82839 6.33683 7.43272 6.58629C7.0131 6.85086 6.30322 7.69409 6.30322 9.17712C6.30322 10.5118 7.15025 11.7721 7.51391 12.2514C7.52296 12.2635 7.53955 12.288 7.56364 12.3232C8.95635 14.3571 10.6926 15.8645 12.4526 16.5676C14.147 17.2444 14.9494 17.3226 15.4055 17.3226C15.4056 17.3226 15.4056 17.3226 15.4056 17.3226C15.5973 17.3226 15.7507 17.3076 15.8861 17.2943L15.9719 17.2861C16.5573 17.2342 17.8436 16.5676 18.1362 15.7545C18.3667 15.1141 18.4275 14.4143 18.2741 14.1604C18.1691 13.9876 17.988 13.9007 17.7589 13.7907Z"
                  fill="white"
                />
                <path
                  d="M12.2131 0C5.71309 0 0.424978 5.24836 0.424978 11.6994C0.424978 13.7859 0.983352 15.8284 2.04118 17.6159L0.0165091 23.5882C-0.0212253 23.6996 0.00685281 23.8227 0.0892122 23.9066C0.148697 23.9673 0.229321 24 0.311681 24C0.343228 24 0.375009 23.9953 0.40604 23.9853L6.63357 22.0064C8.33771 22.9169 10.2638 23.3976 12.2131 23.3976C18.7125 23.3977 24 18.1499 24 11.6994C24 5.24836 18.7125 0 12.2131 0ZM12.2131 20.9606C10.3788 20.9606 8.60232 20.4309 7.07518 19.4288C7.02385 19.3951 6.96423 19.3778 6.90423 19.3778C6.87249 19.3778 6.84071 19.3826 6.80977 19.3925L3.69015 20.3841L4.69721 17.413C4.72979 17.3169 4.71348 17.2108 4.65348 17.1288C3.49055 15.5399 2.87584 13.6625 2.87584 11.6994C2.87584 6.59217 7.06444 2.43708 12.2129 2.43708C17.3608 2.43708 21.5489 6.59217 21.5489 11.6994C21.549 16.8061 17.361 20.9606 12.2131 20.9606Z"
                  fill="white"
                />
              </svg>
              Консультация по WhatsApp
            </button>
          </a>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'header-component',
}
</script>

<style lang="scss" scoped>
.header {
  display: grid;
  grid-template-columns: 1fr auto;
  padding: 1.6rem 0;
  gap: 4rem;
  .header-content {
    display: flex;
    justify-content: space-between;
    .header-logos {
      display: grid;
      grid-template-columns: auto auto;
      gap: 3.2rem;
    }
  }
  .get-consulting {
    background: #ecf6ff;
    border-radius: 8px;
    padding: 1.6rem 2.4rem;
    display: flex;

    align-items: center;
    justify-content: center;
    max-width: 40rem;
    margin: auto;
    color: #004b94;
    p {
      font-weight: bold;
    }
    svg {
      margin-right: 8px;
    }
  }
  @media screen and (max-width: 768px) {
    grid-template-columns: 1fr;
    gap: 1.6rem;
    .header-content {
      .header-logos {
        align-items: center;
        img{
          width: 100%;
          max-width: 9rem;

        }
      }
    }

    .get-consulting {
    }
  }
}
.contacts {
  .call-phone {
    .phone {
      color: #BE6C2F;
      display: flex;
      justify-content: flex-end;
      h3 {
        color: inherit;
        font-size: 1.8rem;
        margin-left: 0.5rem;
      }
    }
    p {
      color: #333333;
      font-weight: 500;
    }
  }
  @media screen and (max-width: 768px) {
    a {
      border: 3px solid #f1f1f4;
      box-sizing: border-box;
      border-radius: 8px;
      padding: 1.2rem;
    }
    display: flex;
    align-items: center;
    justify-content: center;
    p {
      display: none;
    }
  }
}
.banner-consulting__whatsapp{
    display: flex;
    justify-content: center;
    align-items: center;
    text-align: center;
    font-size: 14px;
    height: 4.8rem;
    svg {
      margin-right: 8px;
    }

}
.whatsapp_mobile {
  display: none;
  @media screen and (max-width: 768px) {
    display: block;
  }
}
.whatsapp_desktop {
  @media screen and (max-width: 768px) {
    display: none;
  }
}
</style>
